function createData(
    id,
    no,
    date,
    details,
    employee,
    department,
    branch,
    tel,
    ip,
    status
  ) {
    return {
      id,
      no,
      date,
      details,
      employee,
      department,
      branch,
      tel,
      ip,
      status
    };
  }

export const rows = [
    createData(
      1,
      "IT20030171",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      2,
      "IT20030172",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      3,
      "IT20030173",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      4,
      "IT20030174",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      5,
      "IT20030175",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      6,
      "IT20030176",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      7,
      "IT20030177",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      8,
      "IT20030178",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      9,
      "IT20030179",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      10,
      "IT20030180",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      11,
      "IT20030181",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      12,
      "IT20030182",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    ),
    createData(
      5555555,
      "IT20030183",
      "19/03/2563",
      "ทดสอบๆรายละเอียดยาวมากกกกกกกกกกกกกกกกกกกกกกกกกกกกกกกก",
      "ตุลาการ สังอ่อนดี",
      "(12345) โปรแกรมเมอร์",
      "บางปะกง",
      "999",
      "192.168.5.152",
      "อนุมัติ"
    )
    
  ];